In [1]:
import pandas as pd

In [40]:
dict1 ={'Name' : ['Anand','Akash','Ankith','Amruth','akhay','Abhay','Ankitha','Adya'],
       'Age' : [18,18,18,19,19,20,21,21],
        'Gender':['Male','Male','Male','Male','Male','Male','Female','Female'],
       'Marks':[84,67,93,88,96,95,56,72]
       }

In [41]:
dict1

{'Name': ['Anand',
  'Akash',
  'Ankith',
  'Amruth',
  'akhay',
  'Abhay',
  'Ankitha',
  'Adya'],
 'Age': [18, 18, 18, 19, 19, 20, 21, 21],
 'Gender': ['Male',
  'Male',
  'Male',
  'Male',
  'Male',
  'Male',
  'Female',
  'Female'],
 'Marks': [84, 67, 93, 88, 96, 95, 56, 72]}

In [42]:
data = pd.DataFrame(dict1)

In [43]:
data

      Name  Age  Gender  Marks
0    Anand   18    Male     84
1    Akash   18    Male     67
2   Ankith   18    Male     93
3   Amruth   19    Male     88
4    akhay   19    Male     96
5    Abhay   20    Male     95
6  Ankitha   21  Female     56
7     Adya   21  Female     72

In [44]:
data.head(3)

     Name  Age Gender  Marks
0   Anand   18   Male     84
1   Akash   18   Male     67
2  Ankith   18   Male     93

In [45]:
data.tail(3)

      Name  Age  Gender  Marks
5    Abhay   20    Male     95
6  Ankitha   21  Female     56
7     Adya   21  Female     72

In [46]:
data.shape

(8, 4)

In [47]:
data.shape[0]

8

In [48]:
data.shape[1]

4

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Gender  8 non-null      object
 3   Marks   8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [50]:
data.isnull().sum(axis=0)

Name      0
Age       0
Gender    0
Marks     0
dtype: int64

In [51]:
data.describe(include = 'all')

         Name       Age Gender      Marks
count       8   8.00000      8   8.000000
unique      8       NaN      2        NaN
top     Anand       NaN   Male        NaN
freq        1       NaN      6        NaN
mean      NaN  19.25000    NaN  81.375000
std       NaN   1.28174    NaN  14.754539
min       NaN  18.00000    NaN  56.000000
25%       NaN  18.00000    NaN  70.750000
50%       NaN  19.00000    NaN  86.000000
75%       NaN  20.25000    NaN  93.500000
max       NaN  21.00000    NaN  96.000000

In [52]:
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [53]:
data['Gender'].nunique()

2

In [54]:
data['Gender'].value_counts()

Gender
Male      6
Female    2
Name: count, dtype: int64

In [58]:
data[data['Marks']>=90]

     Name  Age Gender  Marks
2  Ankith   18   Male     93
4   akhay   19   Male     96
5   Abhay   20   Male     95

In [61]:
data[(data['Marks']>=90) & (data['Marks']<=100)]

     Name  Age Gender  Marks
2  Ankith   18   Male     93
4   akhay   19   Male     96
5   Abhay   20   Male     95

In [62]:
len(data[(data['Marks']>=90) & (data['Marks']<=100)])

3

In [64]:
data[data['Marks'].between(90,100)]

     Name  Age Gender  Marks
2  Ankith   18   Male     93
4   akhay   19   Male     96
5   Abhay   20   Male     95

In [66]:
sum(data['Marks'].between(90,100))

3

In [67]:
data['Marks'].mean()

81.375

In [68]:
data['Marks'].min()

56

In [69]:
data['Marks'].max()

96

In [101]:
def marks(x):
    return x//2

In [102]:
data['Half_marks'] = data['Marks'].apply(marks)

In [103]:
data

      Name  Age  Gender  Marks  Half_marks
0    Anand   18    Male     84          42
1    Akash   18    Male     67          33
2   Ankith   18    Male     93          46
3   Amruth   19    Male     88          44
4    akhay   19    Male     96          48
5    Abhay   20    Male     95          47
6  Ankitha   21  Female     56          28
7     Adya   21  Female     72          36

In [104]:
data['Marks'].apply(lambda x:x/2)

0    42.0
1    33.5
2    46.5
3    44.0
4    48.0
5    47.5
6    28.0
7    36.0
Name: Marks, dtype: float64

In [105]:
data['Name'].apply(len)

0    5
1    5
2    6
3    6
4    5
5    5
6    7
7    4
Name: Name, dtype: int64

In [106]:
data

      Name  Age  Gender  Marks  Half_marks
0    Anand   18    Male     84          42
1    Akash   18    Male     67          33
2   Ankith   18    Male     93          46
3   Amruth   19    Male     88          44
4    akhay   19    Male     96          48
5    Abhay   20    Male     95          47
6  Ankitha   21  Female     56          28
7     Adya   21  Female     72          36

In [107]:
data['Male_Female'] =  data['Gender'].map({'Male' : 1,'Female' :0})

In [108]:
data['Male_Female']

0    1
1    1
2    1
3    1
4    1
5    1
6    0
7    0
Name: Male_Female, dtype: int64

In [109]:
data

      Name  Age  Gender  Marks  Half_marks  Male_Female
0    Anand   18    Male     84          42            1
1    Akash   18    Male     67          33            1
2   Ankith   18    Male     93          46            1
3   Amruth   19    Male     88          44            1
4    akhay   19    Male     96          48            1
5    Abhay   20    Male     95          47            1
6  Ankitha   21  Female     56          28            0
7     Adya   21  Female     72          36            0

In [110]:
data.drop('Male_Female',axis=1)

      Name  Age  Gender  Marks  Half_marks
0    Anand   18    Male     84          42
1    Akash   18    Male     67          33
2   Ankith   18    Male     93          46
3   Amruth   19    Male     88          44
4    akhay   19    Male     96          48
5    Abhay   20    Male     95          47
6  Ankitha   21  Female     56          28
7     Adya   21  Female     72          36

In [111]:
data.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [112]:
data

      Name  Age  Gender  Marks
0    Anand   18    Male     84
1    Akash   18    Male     67
2   Ankith   18    Male     93
3   Amruth   19    Male     88
4    akhay   19    Male     96
5    Abhay   20    Male     95
6  Ankitha   21  Female     56
7     Adya   21  Female     72

In [113]:
data.columns

Index(['Name', 'Age', 'Gender', 'Marks'], dtype='object')

In [114]:
data.index

RangeIndex(start=0, stop=8, step=1)

In [117]:
data.sort_values(by ='Marks', ascending = False)

      Name  Age  Gender  Marks
4    akhay   19    Male     96
5    Abhay   20    Male     95
2   Ankith   18    Male     93
3   Amruth   19    Male     88
0    Anand   18    Male     84
7     Adya   21  Female     72
1    Akash   18    Male     67
6  Ankitha   21  Female     56

In [121]:
data[data['Gender'] == 'Female'] [['Name','Marks']]

      Name  Marks
6  Ankitha     56
7     Adya     72

In [124]:
data[data['Gender'].isin(['Female'])] [['Name','Marks']]

      Name  Marks
6  Ankitha     56
7     Adya     72